---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Visual.AssetPropertyFloat
source: html/5638c56e-a515-763d-eb13-a081cb9572e9.htm
---
# AssetPropertyFloat Members

Adds a new connected asset attached to this asset property, if it allows it.